Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: ལམ་ཐམས་ཅད་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of neither adopting nor rejecting any path;

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་འཇུག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of entering the profound perfection of wisdom;

source: སྒོ་ཀུན་ནས་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཐབས་ཀྱི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the method for pervading the realm of the Dharma through every gateway;

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཞི་ཞིང་ཉེ་བར་ཞི་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the pacification of all kleśas;

source: ལྟ་བ་དང་སྲིད་པ་དང་། ང་རྒྱལ་ཐམས་ཅད་སྤོངས་པའི་ཤེས་རབ་ཤས་ཆེ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the greatest wisdom that eliminates all false view, craving, and pride;

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་བ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། རིག་པ་བསྐྱེད་པ་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: and of those who are present within the dwelling of delighting in the arising of all dhyānas, liberations, samādhis, samāpattis, higher cognitions, and knowledges;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་བསྒོམས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: and this is the dwelling of those who are present within the dwelling of meditation on the field of activity of the samādhis of all bodhisattvas.

source: །འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་ཉེ་བར་གནས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: “This is the dwelling of those who are present in the location of being present at the feet of all the buddhas.

source: །འདི་ནི་གང་དེ་དག་བསྐལ་པ་གཅིག་ལ་བསྐལ་པ་ཐམས་ཅད་དང་། བསྐལ་པ་ཐམས་ཅད་ལ་བསྐལ་བ་གཅིག་ཏུ་འཇུག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: “This is the dwelling of those who are present in the location of entering all kalpas within one kalpa and one kalpa within all kalpas;

source: གང་དེ་དག་ཞིང་གཅིག་དང་ཞིང་ཐམས་ཅད་དང་། ཞིང་ཐམས་ཅད་དང་ཞིང་གཅིག་ཏུ་ཐ་མི་དད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where there is no difference between all realms and one realm or between one realm and all realms;

source: གང་དེ་དག་ཆོས་གཅིག་དང་ཆོས་ཐམས་ཅད་དུ། ཆོས་ཐམས་ཅད་དང་ཆོས་གཅིག་ཏུ་མྱི་འགལ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location of compliance with all Dharmas in one Dharma and with one Dharma in all Dharmas;

source: གང་དེ་དག་སེམས་ཅན་གཅིག་དང་། སེམས་ཅན་ཐམས་ཅད་དང་། སེམས་ཅན་གཅིག་ཏུ་ཐ་མི་དད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where there is no difference between all beings and one being or between one being and all beings;

source: གང་དེ་དག་སངས་རྒྱས་གཅིག་དང་། སངས་རྒྱས་ཐམས་ཅད་དུ་སངས་རྒྱས་ཐམས་ཅད་དང་། སངས་རྒྱས་གཅིག་ཏུ་མྱི་གཉིས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where there is no duality between all buddhas and one buddha, or between one buddha and all buddhas;

source: གང་དེ་དག་དུས་ཐམས་ཅད་ལ་སྐད་ཅིག་གཅིག་གིས་འཇུག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where they enter all times in one instant;

source: གང་དེ་དག་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཞིང་ཐམས་ཅད་དུ་འགྲོ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where with a single motivation they go to all realms;

source: གང་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་གཟུགས་བརྙན་སྣང་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where their images appear in the locations of all beings;

source: གང་དེ་དག་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་སེམས་ཀྱི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present in the location where there is the motivation to bring benefit and happiness to all worlds;

source: གང་དེ་དག་ཐོབ་པར་བྱ་བ་ཐམས་ཅད་རང་ལ་རག་ལས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་དེ་དག་གི་གནས་སོ།
en: of those who are present in the location where all attainments are dependent on oneself;

source: །འདི་ནི་གང་དེ་དག་འཇིག་རྟེན་གྱི་གནས་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་ན་སྣང་བ་དང་། གང་དེ་དག་ཞིང་ཐམས་ཅད་ལ་མི་གནས་ཀྱང་།
en: of those who, though they have transcended all worldly locations, appear in the locations of all beings in order to ripen all beings; of those who, though they do not dwell in any realm, are present in all realms in order to make offerings to all the tathāgatas; of those are present in all buddha realms in order to perceive the displays of all buddha realms without moving from their locations;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་སྤྱོད་པ་དང་། གང་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྒྱན་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་སྤྱོད་ཀྱང་གནས་ནས་གཡོ་བ་མེད་པ་དང་། གང་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འདུག་ཀྱང་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་སུ་མངོན་པར་ཞེན་པ་དང་བྲལ་བ་དང་། གང་དེ་དག་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལ་རྟེན་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ན་དེའི་ཡེ་ཤེས་ལ་མཉམ་ཞིང་འདྲ་བ་མེད་པ་དང་། གང་དེ་དག་བདུད་ཀྱི་གནས་ཐམས་ཅད་ན་སྤྱོད་ཀྱང་འདོད་པའི་ཡོན་ཏན་གྱི་དགའ་བ་དང་བྲལ་བ་དང་། གང་དེ་དག་འདུ་ཤེས་ཀྱི་རྣམ་པའི་གནས་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་ཀྱང་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་བསྩལ་བའི་ཡིད་དང་ལྡན་པ་དང་། གང་དེ་དག་འགྲོ་བ་ཐམས་ཅད་དུ་ཁྱབ་པའི་ལུས་དང་ལྡན་ཡང་བདག་དང་སེམས་ཅན་དུ་གཉིས་སུ་བྱ་བར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་ཆུད་པའི་ལུས་དང་ལྡན་ཡང་།
en: of those who though they are present at the feet of all tathāgatas are free from attachment to the concept of buddhas; of those who are present in all the locations where there is reliance on all kalyāṇamitras but there is no wisdom among beings that is equal or similar to theirs; of those who, though they are present in the dwellings of māras, are free of delighting in sensory pleasures; of those who, though they are present in the locations of entry into all conceptual identifications, have minds that have dispelled all conceptual identifications; of those who, though they possess bodies that spread throughout all beings, do not roam with the duality of self and beings;

source: ཆོས་ཀྱི་དབྱིངས་ཐ་དད་དུ་བྱ་བའི་གནས་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་མ་འོངས་པའི་བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་ཡང་།
en: of those who, though they possess bodies that enter all world realms, do not roam through the realm of phenomena as differentiated locations;

source: བསྐལ་པ་རིང་བ་དང་། ཐུང་བའི་འདུ་ཤེས་ཀྱི་རྣམ་པས་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་སྐྲའི་རྩེ་མོ་གཅིག་ནས་མི་གཡོ་ཡང་།
en: of those who, though they pray to be present in all future kalpas, do not dwell in the conceptions of long or short kalpas;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྣང་བ་དེ་ལྟ་བུ་བསྒྲུབ་དཀའ་བའི་ཆོས་ཀྱི་ཕྱོགས་ལ་འཇུག་པ་རྣམ་པར་སྤྱོད་པ་དེ་དག་གིས་གནས་སོ།
en: and of those who, without deviating from the tip of a single hair, appear in all world realms.

source: །འདི་ནི་ཟབ་མོའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་མི་གཉིས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: “This is the dwelling of those who dwell in the location of entering such a difficult direction of the Dharma.

source: མཚན་ཉིད་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: “This is the dwelling of those who dwell in profound locations, who dwell in nondual locations, who dwell in locations without characteristics, who dwell in locations without negations, who dwell in locations without objects of perception, who dwell in locations without conceptual elaborations, who dwell in locations of great love and great compassion, who dwell in locations that śrāvakas and pratyeka­buddhas are unable to enter, who dwell in locations that transcend the scope of all māras, who dwell in locations that are unstained by the scope of all worlds, who dwell in the locations of the perfections of the bodhisattvas, and who dwell in the locations that correspond to the locations of all the buddhas.

source: གཉེན་པོ་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: “They who dwell in the location free of all characteristics do not enter the faultlessness of the śrāvakas.

source: མི་དམྱིགས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: They who dwell in the location of the birthlessness of all phenomena do not fall into the nature of birthlessness.

source: སྤྲོས་པ་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: They who dwell in the location of unattractiveness do not manifest the nature of freedom from desire, nor do they dwell together with the qualities of desire.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: They who dwell in the location of love do not have minds that follow the stains of anger.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཆུད་པར་དཀའ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: They who dwell in the location of dependent origination have no ignorance in relation to all phenomena.

source: བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: They who dwell in the location of the four dhyānas do not arise through the power of dhyāna.

source: འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ཀྱིས་མ་གོས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གནས་དང་མཐུན་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: They who dwell in the location of the four immeasurables do not proceed upon the path of the realm of form, so that they may ripen all beings.

source: །གང་དེ་དག་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པར་མི་འཇུག་པ་དང་། གང་དེ་དག་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་མི་སྐྱེ་བའི་ཆོས་ཉིད་དུ་མི་ལྟུང་བ་དང་། གང་དེ་དག་མི་སྡུག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་མངོན་དུ་མི་བྱེད་དེ་འདོད་ཆགས་ཀྱི་ཆོས་དང་ཡང་ལྷན་ཅིག་མི་གནས་པ་དང་། གང་དེ་དག་བྱམས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཞེ་སྡང་གི་དྲི་མའི་རྗེས་སུ་སོང་བའི་སེམས་མེད་པ་དང་། གང་དེ་དག་རྟེན་ཅིང་འབྲེལ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་རྨོངས་པ་མེད་པ་དང་། གང་དེ་དག་བསམ་གཏན་བཞིའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་བསམ་གཏན་གྱི་དབང་གིས་མི་སྐྱེ་བ་དང་། གང་དེ་དག་ཚད་མེད་པ་བཞིའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་དོན་དུ་གཟུགས་ཀྱི་ཁམས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་མི་འདོང་བ་དང་། གང་དེ་དག་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞིའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་ཟིན་པས་གཟུགས་མེད་པའི་ཁམས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་མི་འདོང་བ་དང་། གང་དེ་དག་ཞི་གནས་དང་ལྷག་མཐོང་གི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར།
en: They who dwell in the location of the four formless samāpattis do not proceed upon the path of the formless realm, because of their possession of great compassion. They who dwell in the location of śamatha and vipaśyanā do not manifest the liberation of their own wisdom, so as to ripen all beings. They who dwell in the location of great equanimity do not abandon the realm of beings. They who dwell in the location of emptiness do not depend on views. They who dwell in the location of characteristiclessness are nevertheless dedicated to guiding beings whose conduct has characteristics.

source: བདག་གིས་རིག་པའི་རྣམ་པར་གྲོལ་བ་མངོན་ཏུ་མི་བྱེད་པ་དང་། གང་དེ་དག་བཏང་སྙོམས་ཆེན་པོའི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་མི་གཏོང་བ་དང་། གང་དེ་དག་སྟོང་པ་ཉིད་ཀྱི་གནས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ལྟ་བའི་རྣམ་པ་ལ་མི་གནས་པ་དང་། གང་དེ་དག་མཚན་མ་མེད་པའི་སྤྱོད་ཡུལ་དང་ལྡན་ཡང་མཚན་མ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམ་པར་གདུལ་བ་ལ་བརྩོན་པ་དང་། གང་དེ་དག་སྨོན་ལམ་ཐམས་ཅད་དང་བྲལ་བ་ཡིན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱུན་མི་འཆད་པ་དང་། གང་དེ་དག་ལས་དང་ཉོན་མོངས་པ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་ལས་དང་ཉོན་མོངས་པའི་རྗེས་སུ་འབྲང་བར་སྣང་བ་དང་། གང་དེ་དག་ཤི་འཕོ་དང་སྐྱེ་བ་ཡོངས་སུ་ཤེས་ཀྱང་ཚེའི་ཤི་འཕོ་དང་སྐྱེ་བ་ཡོངས་སུ་སྟོན་པ་དང་། གང་དེ་དག་འགྲོ་བ་ཐམས་ཅད་ལས་རྣམ་པར་ལོག་ཀྱང་སེམས་ཅན་གདུལ་བའི་དབང་གིས་འགྲོ་བ་ཐམས་ཅད་དུ་འདོང་བ་དང་། གང་དེ་དག་བྱམས་པ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་གང་ལ་ཡང་ཆགས་པར་རྣམ་པར་སྤྱོད་པ་མེད་པ་དང་། གང་དེ་དག་སྙིང་རྗེ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་གང་ལ་ཡང་ཆགས་པར་ལྟ་བས་རྣམ་པར་སྤྱོད་པ་མ་ཡིན་པ་དང་། གང་དེ་དག་དགའ་བ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་སེམས་ཅན་སྡུག་བསྔལ་བ་ལ་རྣམ་པར་བལྟ་བས་རྟག་ཏུ་མི་དགའ་བ་དང་། གང་དེ་དག་བཏང་སྙོམས་ལ་རྣམ་པར་སྤྱོད་ཀྱང་གཞན་གྱི་དོན་ལ་རྟག་ཏུ་འབད་པ་དང་། གང་དེ་དག་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་འདོད་པའི་ཁམས་སུ་སྐྱེ་བ་ལ་མི་སྨོད་པ་དང་། གང་དེ་དག་སྐྱེ་བ་ཐམས་ཅད་ལ་མི་གནས་པར་རྣམ་པར་སྤྱོད་ཀྱང་ཡང་དག་པའི་མཐའ་མངོན་དུ་བྱ་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་རྣམ་པར་ཐར་པ་གསུམ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཉན་ཐོས་ཀྱི་རྣམ་པར་ཐར་པ་ཐོབ་པར་བྱ་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་འཕགས་པའི་བདེན་པ་བཞི་རྣམ་པར་ལྟ་བ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་འབྲས་བུ་མངོན་དུ་བྱ་བའི་ཕྱིར་རྣམ་པར་མི་སྤྱོད་པ་དང་གང་དེ་དག་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོ་བརྟགས་པ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཤིན་ཏུ་འགོག་པར་ལྟུང་བར་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་འཕགས་པའི་ལམ་གྱི་ཡན་ལག་བརྒྱད་བསྒོམ་པ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཤིན་ཏུ་འབྱུང་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཤིན་ཏུ་འདས་པར་རྣམ་པར་སྤྱོད་ཀྱང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ཡོངས་སུ་ཤེས་པ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཕུང་པོ་ཤིན་ཏུ་འགོག་པར་ལྟུང་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་བདུད་ཀྱི་ལས་བཞི་ལས་ཤིན་ཏུ་འདས་པར་རྣམ་པར་སྤྱོད་ཀྱང་བདུད་དུ་རྟོག་པ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་སྐྱེ་མཆེད་དྲུག་ལས་ཤིན་ཏུ་འདས་པར་རྣམ་པར་སྤྱོད་ཀྱང་ཤིན་ཏུ་མངོན་པར་འགྲུབ་པ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་དེ་བཞིན་ཉིད་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཡང་དག་པའི་མཐར་ལྟུང་བ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དང་། གང་དེ་དག་ཐེག་པ་ཐམས་ཅད་ཀྱིས་འབྱུང་བ་ཡོངས་སུ་སྟོན་པ་ལ་རྣམ་པར་སྤྱོད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལས་ཉམས་པ་ལ་རྣམ་པར་མི་སྤྱོད་པ་དེ་དག་དེ་ལྟ་བུར་ཡོན་ཏན་གྱི་གནས་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: They who are free of all aspirations nevertheless have the continuous aspiration of bodhisattva conduct. They who have power over all karma and kleśas nevertheless, in order to ripen beings, appear to follow karma and kleśas. They who know death, transference, and rebirth nevertheless manifest the death, transference, and rebirth of lives. They who have turned away from the existences of beings nevertheless, in order to guide beings, proceed throughout all the existences of beings. They who dwell in love nevertheless do not dwell in attachment toward anything. They who dwell in compassion nevertheless do not dwell in the view of attachment to anything. They who dwell in rejoicing nevertheless are always unhappy to view the suffering of beings. They who dwell in equanimity nevertheless always strive for the benefit of others. They who dwell in the nine successive states of samāpatti nevertheless do not denigrate birth in the desire realm. They who dwell in nondependence on all births nevertheless do not dwell in the manifestation of the final conclusion of existence. They who dwell in the three doors to liberation nevertheless do not dwell in the attainment of the śrāvaka liberation. They who dwell in the view of the four truths of the āryas nevertheless do not dwell in the manifestation of their result. They who dwell in the analysis of profound dependent origination nevertheless do not dwell in the fall into cessation. They who dwell in meditation on the eightfold path nevertheless do not dwell in the ultimate departure. They who dwell in transcendence from ordinary beings nevertheless do not dwell in the fall to the levels of the śrāvakas and pratyeka­buddhas. They who dwell in the knowledge of the grasping five skandhas nevertheless do not dwell in the fall into the ultimate cessation. They who dwell in transcendence from the paths of the four māras do not dwell in the concepts of the māras. They who dwell in transcendence from the six āyatanas nevertheless do not dwell in the ultimate accomplishment. They who dwell in the true nature nevertheless do not dwell in the fall into the ultimate conclusion. They who dwell in the teaching of setting forth through all yānas nevertheless do not dwell in a lapse from the Mahāyāna. This is the dwelling of those who dwell in all such qualities.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then Sudhana, the head merchant’s son, recited these verses:

source: །འདི་ལ་ཐུགས་རྗེ་ཆེན་པོ་བརྙེས་པས་རྣམ་དག་པ།
en: “Here is the glorious kalyāṇamitra Maitreya, who is pure,

source: །བྱམས་པ་བཤེས་གཉེན་དཔལ་ཆེན་འཇིག་རྟེན་ཕན་བརྩོན་པ།
en: Has attained great compassion, is dedicated to benefiting the world,

source: །དབང་བསྐུར་ས་གནས་རྒྱལ་བའི་སྲས་ཀྱི་ཐུ་བོ་སྟེ།
en: Resides on the level of empowerment, is the senior son of the jinas,

source: །སངས་རྒྱས་ཡུལ་ལ་རྗེས་སུ་དགོངས་ཤིང་རྣམ་པར་སྤྱོད།
en: And contemplates and resides within the range of perception of the buddhas. “This place resembles the abode of all the unequaled

source: །རྒྱལ་བའི་སྲས་པོ་གྲགས་པ་ཆེན་པོ་མངའ་བ་རྣམས།
en: Sons of the jinas who are endowed with great renown,

source: །ཡེ་ཤེས་ཆེན་པོའི་སྤྱོད་ཡུལ་རྣམ་ཐར་བཞུགས་པ་དག །གང་རྣམས་ཆོས་དབྱིངས་ཀུན་ཏུ་ཐོགས་མེད་རྣམ་རྒྱུ་བ།
en: Are established in the liberation of great wisdom’s range of activity, And move without impediment through the entire realm of phenomena.

source: །དཔེ་ཟླ་མེད་པ་དེ་དག་གནས་ནི་འདི་འདྲ་ཡིན།
en: “This is the dwelling of those who have perfected the Mahāyāna, have ascended through

source: །དུས་སྦྱིན་ཚུལ་ཁྲིམས་བཟོད་པ་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་འཕགས།
en: Their power of self-control, generosity, correct conduct, patience, and diligence,

source: །བསམ་གཏན་མངོན་ཤེས་སྟོབས་ཀྱི་མཐར་ཕྱིན་ཤེས་རྟོགས་པས།
en: Have realized the perfection of the power of higher cognition through dhyāna,

source: །ཤེས་རབ་ཐབས་དང་སྨོན་ལམ་སྟོབས་ལ་གནས་པ་རྣམས།
en: And are established in wisdom, method, prayer, and strength.

source: །ཐེག་ཆེན་ཕ་རོལ་ཕྱིན་པ་རྣམས་ཀྱི་གནས་འདི་ཡིན།
en: “This is the dwelling of those who meditate on all things in all existences,

source: །འདི་ནི་ཆགས་མེད་བློ་གྲོས་བསམ་པ་རྒྱ་ཆེན་ཏེ།
en: Who have unimpeded understanding and vast motivation,

source: །ནམ་མཁའི་སྤྱོད་ཡུལ་ལྡན་པ་མི་གནས་མི་རྟེན་པ།
en: Who have space as their sphere of activity without location or basis,

source: །དུས་གསུམ་ཐམས་ཅད་རྒྱས་འགེངས་བསྒྲིབས་པ་མེད་པའི་རྣམས།
en: And who pervade the three times without obscuration.

source: །སྲིད་ཀུན་དངོས་པོ་རྣམ་པར་བསྒོམས་པ་རྣམས་ཀྱི་གནས།
en: “This is the dwelling of those who have fearless wisdom,

source: །གང་རྣམས་ཆོས་ཀུན་མི་སྐྱེའི་ཚུལ་ལ་ཞུགས་པ་རྣམས།
en: Who comprehend the birthlessness of all phenomena,

source: །ཆོས་ཀྱི་རང་བཞིན་ནམ་མཁའི་དངོས་ཉིད་རྟོགས་མཛད་ལ།
en: Who realize the nature of phenomena to be the nature of space

source: །ཅི་ལའང་གནས་པ་མི་མཛད་ནམ་མཁའི་བྱ་བཞིན་ཏེ།
en: And are like a bird in the sky, not needing a support.

source: །མཁྱེན་པས་བསྙེངས་པ་མི་མངའ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who have peace and serenity,

source: །གང་རྣམས་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་རང་བཞིན་དངོས།
en: Who know the nature of desire, of anger, and of ignorance—

source: །རྟོག་པའི་རྒྱུས་བསྐྱེད་ཕྱིན་ཅི་ལོག་ལས་བྱུང་མཁྱེན་ནས།
en: That thoughts are the cause of their arising and their origin is in error—

source: །འདོད་ཆགས་བྲལ་བའང་རྣམ་པར་རྟོག་པ་མི་མཛད་པ།
en: And who do conceptualize and are free from desire.

source: །ཞི་དང་ཉེ་བར་ཞི་ལྡན་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are skilled in wisdom and method, Who are wise in their perception of the liberations,

source: །གང་རྣམས་རྣམ་པར་ཐར་དང་བདེན་ཚུལ་འཕགས་ལམ་དང་། །ཕུང་པོ་དེ་བཞིན་ཁམས་དང་སྐྱེ་མཆེད་རྟེན་པའི་དངོས།
en: The ārya path’s way of truth, the nature of dependence on the skandhas

source: །ཡོངས་སུ་རྟོགས་མཛད་མཁས་པ་ཞི་བར་མི་ལྟུང་བ།
en: Dhātus, and āyatanas, and who do not fall into peace.

source: །ཤེས་རབ་ཐབས་ལ་མཁས་པ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are dedicated to peace,

source: གང་རྣམས་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཕྱོགས་ཞུགས་ཤིང་། །རྒྱལ་བའི་ཞིང་ལ་ཡོངས་རྟོག་རྣམ་རྟོག་ཀུན་ཞི་ལ།
en: Who have entered the direction to unobscured wisdom, Who conceive of the realms of jinas and have pacified all thoughts

source: །ཆོས་རྣམས་དངོས་པོའི་རང་བཞིན་མེད་པར་རྟོགས་མཛད་པ།
en: And have realized that phenomena have no nature of their own.

source: །ཞི་བར་གཞོལ་བ་དེ་དག་གནས་ནི་འདི་འདྲའོ།
en: “This is the dwelling of those who have nondependent realization,

source: །གང་རྣམས་ཆགས་མེད་སྤྱོད་པས་ཆོས་དབྱིངས་འདི་དག་ཏུ།
en: Whose conduct has no impediment within the realm of phenomena,

source: །དངོས་དང་བྲལ་བར་རྣམ་སྤྱོད་མཁའ་ཡི་རླུང་འདྲ་བ།
en: Whose conduct, like the wind in the sky, is devoid of existents,

source: །དངོས་པོ་ཀུན་དང་བྲལ་ཞིང་དངོས་མེད་རྣམ་སྤྱོད་པ།
en: Who are devoid of any location and have a location-free conduct.

source: །མི་གནས་བློ་མངའ་དེ་དག་གནས་ནི་འདི་ཡང་འདྲ།
en: “This is the dwelling of those who have love and compassion,

source: །གང་རྣམས་ངན་སོང་རྒྱུད་དུ་འགྲོ་བ་སོང་གྱུར་ཏེ།
en: Who, on seeing those who have gone to the lower realms

source: །སྡུག་བསྔལ་ནད་པ་མི་བདེ་ཉམས་སུ་མྱོང་གཟིགས་ཤིང་།
en: And are experiencing suffering, illness, and unhappiness,

source: །བྱམས་པའི་འོད་ཀྱིས་ངན་སོང་ཐམས་ཅད་ཞི་མཛད་པ།
en: Bring peace to the lower realms with the light of their love.

source: །བྱམས་དང་ཐུགས་རྗེའི་ཐུགས་མངའ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are like caravan leaders, Who, on seeing this world as being like sightless blind travelers

source: །ཉམ་ངའི་འཁོར་ན་གནས་ཤིང་འཕགས་ལམ་གོལ་གྱུར་ཏེ། །འདྲོན་པ་དམུས་ལོང་དམྱིགས་དང་བྲལ་བར་འགྱུར་འདྲ་བའི།
en: Who have lost the path of the āryas on the difficult road of saṃsāra,

source: །འཇིག་རྟེན་གཟིགས་ཤིང་ཐར་ལམ་རབ་ལ་འགོད་མཛད་པ།
en: Lead them on the path to liberation.

source: །འདྲོན་པོའི་བསེལ་རབ་འདྲ་བ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those unconquerable heroes Who, on seeing beings caught in the noose of Māra

source: །གང་རྣམས་སྐྱེ་དང་མྱ་ངན་རྒ་ཤི་དབང་གྱུར་པའི། །འགྲོ་བ་བདུད་ཀྱི་ཞགས་པས་ཡོངས་སུ་བཅིངས་གཟིགས་ཤིང་།
en: And under the power of birth, misery, aging, and death,

source: །རྣམ་པར་བཀྲོལ་ནས་མི་འཇིགས་ཕྱོགས་བདེར་འདོན་མཛད་པ།
en: Liberate them and safely take them in the direction free from fear.

source: །དཔའ་བོ་དེ་དག་ཐུབ་པར་དཀའ་བའི་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are like great kings of physicians,

source: །ཉོན་མོངས་ནད་པའི་འགྲོ་མང་གང་གིས་གཟིགས་གྱུར་ཅིང་།
en: Who, on seeing multitudes of beings sick with the kleśas,

source: །ཡེ་ཤེས་བདུད་རྩི་སྨན་ཆེན་ཡོངས་སུ་བསྡུ་མཛད་ནས།
en: Gather together the great herbs of the amrita of wisdom

source: །ཐུགས་རྗེ་ཆེན་པོ་བསྐྱེད་ཅིང་ཡོངས་སུ་འགྲེལ་མཛད་པ།
en: And, developing vast compassion, liberate them.

source: །སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་འདྲ་བའི་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are like sons of mariners,

source: །གང་གིས་འགྲོ་མང་སྡུག་བསྔལ་མགོན་མེད་གྱུར་པ་རྣམས།
en: Who, on seeing multitudes of beings suffering with no protector,

source: །ཉོན་མོངས་གཏོས་སུ་ལྷུང་སྟེ་ཚམ་གྱི་མཚོར་ལྷུང་བ།
en: Who have fallen into the kleśas, fallen into the ocean of death,

source: །གཟིགས་ཤིང་དགེ་བའི་ཆོས་ཀྱི་གྲུ་ཆེན་ཡོངས་སྦྱར་སྟེ།
en: Rescue them onto the great ship of the good Dharma.

source: །སྒྲོལ་མཛད་མཉན་པའི་བུ་འདྲ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are like sons of fishermen,

source: །གང་གིས་ཉོན་མོངས་རྒྱ་མཚོ་སྤྱོད་པའི་འགྲོ་གཟིགས་ཤིང་།
en: Who, on seeing beings wandering in the ocean of the kleśas;

source: །ཐམས་ཅད་མཁྱེན་ཐུགས་རིན་ཆེན་དགོངས་དག་སེམས་ཅན་མཆོག །སྲིད་པའི་རྒྱ་མཚོར་གཤེགས་ཤིང་མངོན་པར་འདྲེན་མཛད་པ།
en: Those supreme beings, with the precious motivation of omniscience, Go into the ocean of existences and bring them out.

source: །མཉན་པའི་བུ་ལྟར་སྤྱོད་པ་དེ་དག་གནས་འདི་ཡིན།
en: “This is the dwelling of those who are like garuḍa princes,

source: །སྨོན་ལམ་གནས་ན་བཞུགས་ཤིང་ཐུགས་རྗེ་བྱམས་སྤྱན་གྱིས།
en: Who dwell on the ground of prayer and have the sight of love and compassion,

source: །གང་རྣམས་སེམས་ཅན་གནས་སུ་རྣམ་པར་གཟིགས་མཛད་ཅིང་།
en: Who look upon the dwelling places of all beings

source: །སྲིད་པའི་རྒྱ་མཚོ་གནས་པའི་འགྲོ་མང་མངོན་འདོན་པ།
en: And liberate multitudes from their locations in the ocean of existences.

source: །མཁའ་ལྡིང་གཞོན་འདྲ་དེ་དག་གནས་ནི་འདི་འདྲའོ།
en: “This is the dwelling of those who are like illuminators of the world,

source: །གང་རྣམས་ཆོས་དབྱིངས་མཁའ་ལ་ཉི་ཟླ་འདྲ་ཚུལ་དུ།
en: Who, like suns and moons in the sky of the realm of phenomena,

source: །སེམས་ཅན་གནས་སུ་འོད་ཀྱིས་ཁྱབ་པར་རྣམ་སྤྱོད་པ།
en: Have a conduct that spreads light throughout the habitations of beings,

source: །སྨོན་ལམ་དཀྱིལ་འཁོར་ཡེ་ཤེས་དྲི་མེད་བཟང་པོའི་འོད།
en: The excellent, stainless light of wisdom from the disks of prayer.
